tonyrang/dsp_study/03-firmware/TMS320F28075/adc_ex1_soc_software/device/driverlib/inc/hw_epwm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GLDCFG register
//
//*****************************************************************************
#define EPWM_GLDCFG_TBPRD_TBPRDHR  0x1U         // Global load event
                                               // configuration for TBPRD:TBPRDHR
#define EPWM_GLDCFG_CMPA_CMPAHR   0x2U         // Global load event
                                               // configuration for CMPA:CMPAHR
#define EPWM_GLDCFG_CMPB_CMPBHR   0x4U         // Global load event
                                               // configuration for CMPB:CMPBHR
#define EPWM_GLDCFG_CMPC          0x8U         // Global load event
                                               // configuration for CMPC
#define EPWM_GLDCFG_CMPD          0x10U        // Global load event
                                               // configuration for CMPD
#define EPWM_GLDCFG_DBRED_DBREDHR  0x20U        // Global load event
                                               // configuration for DBRED:DBREDHR
#define EPWM_GLDCFG_DBFED_DBFEDHR  0x40U        // Global load event
                                               // configuration for DBFED:DBFEDHR
#define EPWM_GLDCFG_DBCTL         0x80U        // Global load event
                                               // configuration for DBCTL
#define EPWM_GLDCFG_AQCTLA_AQCTLA2  0x100U       // Global load event
                                               // configuration for AQCTLA/A2
#define EPWM_GLDCFG_AQCTLB_AQCTLB2  0x200U       // Global load event
                                               // configuration for AQCTLB/B2
#define EPWM_GLDCFG_AQCSFRC       0x400U       // Global load event
                                               // configuration for AQCSFRC

//*****************************************************************************
//
// The following are defines for the bit fields in the EPWMXLINK register
//
//*****************************************************************************
#define EPWM_XLINK_TBPRDLINK_S    0U
#define EPWM_XLINK_TBPRDLINK_M    0xFU         // TBPRD:TBPRDHR  Link
#define EPWM_XLINK_CMPALINK_S     4U
#define EPWM_XLINK_CMPALINK_M     0xF0U        // CMPA:CMPAHR Link
#define EPWM_XLINK_CMPBLINK_S     8U
#define EPWM_XLINK_CMPBLINK_M     0xF00U       // CMPB:CMPBHR Link
#define EPWM_XLINK_CMPCLINK_S     12U
#define EPWM_XLINK_CMPCLINK_M     0xF000U      // CMPC Link
#define EPWM_XLINK_CMPDLINK_S     16U
#define EPWM_XLINK_CMPDLINK_M     0xF0000U     // CMPD Link
#define EPWM_XLINK_GLDCTL2LINK_S  28U
#define EPWM_XLINK_GLDCTL2LINK_M  0xF0000000U  // GLDCTL2 Link

//*****************************************************************************
//
// The following are defines for the bit fields in the AQCTLA register
//
//*****************************************************************************
#define EPWM_AQCTLA_ZRO_S         0U
#define EPWM_AQCTLA_ZRO_M         0x3U         // Action Counter = Zero
#define EPWM_AQCTLA_PRD_S         2U
#define EPWM_AQCTLA_PRD_M         0xCU         // Action Counter = Period
#define EPWM_AQCTLA_CAU_S         4U
#define EPWM_AQCTLA_CAU_M         0x30U        // Action Counter = Compare A Up
#define EPWM_AQCTLA_CAD_S         6U
#define EPWM_AQCTLA_CAD_M         0xC0U        // Action Counter = Compare A
                                               // Down
#define EPWM_AQCTLA_CBU_S         8U
#define EPWM_AQCTLA_CBU_M         0x300U       // Action Counter = Compare B Up
#define EPWM_AQCTLA_CBD_S         10U
#define EPWM_AQCTLA_CBD_M         0xC00U       // Action Counter = Compare B
                                               // Down

//*****************************************************************************
//
// The following are defines for the bit fields in the AQCTLA2 register
//
//*****************************************************************************
#define EPWM_AQCTLA2_T1U_S        0U
#define EPWM_AQCTLA2_T1U_M        0x3U         // Action when event occurs on
                                               // T1 in UP-Count
#define EPWM_AQCTLA2_T1D_S        2U
#define EPWM_AQCTLA2_T1D_M        0xCU         // Action when event occurs on
                                               // T1 in DOWN-Count
#define EPWM_AQCTLA2_T2U_S        4U
#define EPWM_AQCTLA2_T2U_M        0x30U        // Action when event occurs on
                                               // T2 in UP-Count
#define EPWM_AQCTLA2_T2D_S        6U
#define EPWM_AQCTLA2_T2D_M        0xC0U        // Action when event occurs on
                                               // T2 in DOWN-Count

//*****************************************************************************
//
// The following are defines for the bit fields in the AQCTLB register
//
//*****************************************************************************
#define EPWM_AQCTLB_ZRO_S         0U
#define EPWM_AQCTLB_ZRO_M         0x3U         // Action Counter = Zero
#define EPWM_AQCTLB_PRD_S         2U
#define EPWM_AQCTLB_PRD_M         0xCU         // Action Counter = Period
#define EPWM_AQCTLB_CAU_S         4U
#define EPWM_AQCTLB_CAU_M         0x30U        // Action Counter = Compare A Up
#define EPWM_AQCTLB_CAD_S         6U
#define EPWM_AQCTLB_CAD_M         0xC0U        // Action Counter = Compare A
                                               // Down
#define EPWM_AQCTLB_CBU_S         8U
#define EPWM_AQCTLB_CBU_M         0x300U       // Action Counter = Compare B Up
#define EPWM_AQCTLB_CBD_S         10U
#define EPWM_AQCTLB_CBD_M         0xC00U       // Action Counter = Compare B
                                               // Down

//*****************************************************************************
//
// The following are defines for the bit fields in the AQCTLB2 register
//
//*****************************************************************************
#define EPWM_AQCTLB2_T1U_S        0U
#define EPWM_AQCTLB2_T1U_M        0x3U         // Action when event occurs on
                                               // T1 in UP-Count
#define EPWM_AQCTLB2_T1D_S        2U
#define EPWM_AQCTLB2_T1D_M        0xCU         // Action when event occurs on
                                               // T1 in DOWN-Count
#define EPWM_AQCTLB2_T2U_S        4U
#define EPWM_AQCTLB2_T2U_M        0x30U        // Action when event occurs on
                                               // T2 in UP-Count
#define EPWM_AQCTLB2_T2D_S        6U
#define EPWM_AQCTLB2_T2D_M        0xC0U        // Action when event occurs on
                                               // T2 in DOWN-Count

//*****************************************************************************
//
// The following are defines for the bit fields in the AQSFRC register
//
//*****************************************************************************
#define EPWM_AQSFRC_ACTSFA_S      0U
#define EPWM_AQSFRC_ACTSFA_M      0x3U         // Action when One-time SW Force
                                               // A Invoked
#define EPWM_AQSFRC_OTSFA         0x4U         // One-time SW Force A Output
#define EPWM_AQSFRC_ACTSFB_S      3U
#define EPWM_AQSFRC_ACTSFB_M      0x18U        // Action when One-time SW Force
                                               // B Invoked
#define EPWM_AQSFRC_OTSFB         0x20U        // One-time SW Force A Output
#define EPWM_AQSFRC_RLDCSF_S      6U
#define EPWM_AQSFRC_RLDCSF_M      0xC0U        // Reload from Shadow Options

//*****************************************************************************
//
// The following are defines for the bit fields in the AQCSFRC register
//
//*****************************************************************************
#define EPWM_AQCSFRC_CSFA_S       0U
#define EPWM_AQCSFRC_CSFA_M       0x3U         // Continuous Software Force on
                                               // output A
#define EPWM_AQCSFRC_CSFB_S       2U
#define EPWM_AQCSFRC_CSFB_M       0xCU         // Continuous Software Force on
                                               // output B

//*****************************************************************************
//
// The following are defines for the bit fields in the DBRED register
//
//*****************************************************************************
#define EPWM_DBRED_DBRED_S        0U
#define EPWM_DBRED_DBRED_M        0x3FFFU      // Rising edge delay value

//*****************************************************************************
//
// The following are defines for the bit fields in the DBFED register
//
//*****************************************************************************
#define EPWM_DBFED_DBFED_S        0U
#define EPWM_DBFED_DBFED_M        0x3FFFU      // Falling edge delay value

//*****************************************************************************
//
// The following are defines for the bit fields in the TBPHS register
//
//*****************************************************************************
#define EPWM_TBPHS_TBPHS_S        16U
#define EPWM_TBPHS_TBPHS_M        0xFFFF0000U  // Phase Offset Register

//*****************************************************************************
//
// The following are defines for the bit fields in the CMPA register
//
//*****************************************************************************
#define EPWM_CMPA_CMPA_S          16U
#define EPWM_CMPA_CMPA_M          0xFFFF0000U  // Compare A Register

//*****************************************************************************
//
// The following are defines for the bit fields in the CMPB register
//
//*****************************************************************************
#define EPWM_CMPB_CMPB_S          16U
#define EPWM_CMPB_CMPB_M          0xFFFF0000U  // Compare B Register

//*****************************************************************************
//
// The following are defines for the bit fields in the GLDCTL2 register
//
//*****************************************************************************
#define EPWM_GLDCTL2_OSHTLD       0x1U         // Enable reload event in one
                                               // shot mode
#define EPWM_GLDCTL2_GFRCLD       0x2U         // Force reload event in one
                                               // shot mode

//*****************************************************************************
//
// The following are defines for the bit fields in the TZSEL register
//
//*****************************************************************************
#define EPWM_TZSEL_CBC1           0x1U         // TZ1 CBC select
#define EPWM_TZSEL_CBC2           0x2U         // TZ2 CBC select
#define EPWM_TZSEL_CBC3           0x4U         // TZ3 CBC select
#define EPWM_TZSEL_CBC4           0x8U         // TZ4 CBC select
#define EPWM_TZSEL_CBC5           0x10U        // TZ5 CBC select
#define EPWM_TZSEL_CBC6           0x20U        // TZ6 CBC select
#define EPWM_TZSEL_DCAEVT2        0x40U        // DCAEVT2 CBC select
#define EPWM_TZSEL_DCBEVT2        0x80U        // DCBEVT2 CBC select
#define EPWM_TZSEL_OSHT1          0x100U       // One-shot TZ1 select
#define EPWM_TZSEL_OSHT2          0x200U       // One-shot TZ2 select
#define EPWM_TZSEL_OSHT3          0x400U       // One-shot TZ3 select
#define EPWM_TZSEL_OSHT4          0x800U       // One-shot TZ4 select
#define EPWM_TZSEL_OSHT5          0x1000U      // One-shot TZ5 select
#define EPWM_TZSEL_OSHT6          0x2000U      // One-shot TZ6 select
#define EPWM_TZSEL_DCAEVT1        0x4000U      // One-shot DCAEVT1 select
#define EPWM_TZSEL_DCBEVT1        0x8000U      // One-shot DCBEVT1 select

//*****************************************************************************
//
// The following are defines for the bit fields in the TZDCSEL register
//
//*****************************************************************************
#define EPWM_TZDCSEL_DCAEVT1_S    0U
#define EPWM_TZDCSEL_DCAEVT1_M    0x7U         // Digital Compare Output A
                                               // Event 1
#define EPWM_TZDCSEL_DCAEVT2_S    3U
#define EPWM_TZDCSEL_DCAEVT2_M    0x38U        // Digital Compare Output A
                                               // Event 2
#define EPWM_TZDCSEL_DCBEVT1_S    6U
#define EPWM_TZDCSEL_DCBEVT1_M    0x1C0U       // Digital Compare Output B
                                               // Event 1
#define EPWM_TZDCSEL_DCBEVT2_S    9U
#define EPWM_TZDCSEL_DCBEVT2_M    0xE00U       // Digital Compare Output B
                                               // Event 2

//*****************************************************************************
//
// The following are defines for the bit fields in the TZCTL register
//
//*****************************************************************************
#define EPWM_TZCTL_TZA_S          0U
#define EPWM_TZCTL_TZA_M          0x3U         // TZ1 to TZ6 Trip Action On
                                               // EPWMxA
#define EPWM_TZCTL_TZB_S          2U
#define EPWM_TZCTL_TZB_M          0xCU         // TZ1 to TZ6 Trip Action On
                                               // EPWMxB
#define EPWM_TZCTL_DCAEVT1_S      4U
#define EPWM_TZCTL_DCAEVT1_M      0x30U        // EPWMxA action on DCAEVT1
#define EPWM_TZCTL_DCAEVT2_S      6U
#define EPWM_TZCTL_DCAEVT2_M      0xC0U        // EPWMxA action on DCAEVT2
#define EPWM_TZCTL_DCBEVT1_S      8U
#define EPWM_TZCTL_DCBEVT1_M      0x300U       // EPWMxB action on DCBEVT1
#define EPWM_TZCTL_DCBEVT2_S      10U
#define EPWM_TZCTL_DCBEVT2_M      0xC00U       // EPWMxB action on DCBEVT2

//*****************************************************************************
//
// The following are defines for the bit fields in the TZCTL2 register
//
//*****************************************************************************
#define EPWM_TZCTL2_TZAU_S        0U
#define EPWM_TZCTL2_TZAU_M        0x7U         // Trip Action On EPWMxA while
                                               // Count direction is UP
#define EPWM_TZCTL2_TZAD_S        3U
#define EPWM_TZCTL2_TZAD_M        0x38U        // Trip Action On EPWMxA while
                                               // Count direction is DOWN
#define EPWM_TZCTL2_TZBU_S        6U
#define EPWM_TZCTL2_TZBU_M        0x1C0U       // Trip Action On EPWMxB while
                                               // Count direction is UP
#define EPWM_TZCTL2_TZBD_S        9U
#define EPWM_TZCTL2_TZBD_M        0xE00U       // Trip Action On EPWMxB while
                                               // Count direction is DOWN
#define EPWM_TZCTL2_ETZE          0x8000U      // TZCTL2 Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the TZCTLDCA register
//
//*****************************************************************************
#define EPWM_TZCTLDCA_DCAEVT1U_S  0U
#define EPWM_TZCTLDCA_DCAEVT1U_M  0x7U         // DCAEVT1 Action On EPWMxA
                                               // while Count direction is UP
#define EPWM_TZCTLDCA_DCAEVT1D_S  3U
#define EPWM_TZCTLDCA_DCAEVT1D_M  0x38U        // DCAEVT1 Action On EPWMxA
                                               // while Count direction is DOWN
#define EPWM_TZCTLDCA_DCAEVT2U_S  6U
#define EPWM_TZCTLDCA_DCAEVT2U_M  0x1C0U       // DCAEVT2 Action On EPWMxA
                                               // while Count direction is UP
#define EPWM_TZCTLDCA_DCAEVT2D_S  9U
#define EPWM_TZCTLDCA_DCAEVT2D_M  0xE00U       // DCAEVT2 Action On EPWMxA
                                               // while Count direction is DOWN

//*****************************************************************************
//
// The following are defines for the bit fields in the TZCTLDCB register
//
//*****************************************************************************
#define EPWM_TZCTLDCB_DCBEVT1U_S  0U
#define EPWM_TZCTLDCB_DCBEVT1U_M  0x7U         // DCBEVT1 Action On EPWMxA
                                               // while Count direction is UP
#define EPWM_TZCTLDCB_DCBEVT1D_S  3U
#define EPWM_TZCTLDCB_DCBEVT1D_M  0x38U        // DCBEVT1 Action On EPWMxA
                                               // while Count direction is DOWN
#define EPWM_TZCTLDCB_DCBEVT2U_S  6U
#define EPWM_TZCTLDCB_DCBEVT2U_M  0x1C0U       // DCBEVT2 Action On EPWMxA
                                               // while Count direction is UP
#define EPWM_TZCTLDCB_DCBEVT2D_S  9U
#define EPWM_TZCTLDCB_DCBEVT2D_M  0xE00U       // DCBEVT2 Action On EPWMxA
                                               // while Count direction is DOWN

//*****************************************************************************
//
// The following are defines for the bit fields in the TZEINT register
//
//*****************************************************************************
#define EPWM_TZEINT_CBC           0x2U         // Trip Zones Cycle By Cycle Int
                                               // Enable
#define EPWM_TZEINT_OST           0x4U         // Trip Zones One Shot Int
                                               // Enable
#define EPWM_TZEINT_DCAEVT1       0x8U         // Digital Compare A Event 1 Int
                                               // Enable
#define EPWM_TZEINT_DCAEVT2       0x10U        // Digital Compare A Event 2 Int
                                               // Enable
#define EPWM_TZEINT_DCBEVT1       0x20U        // Digital Compare B Event 1 Int
                                               // Enable
#define EPWM_TZEINT_DCBEVT2       0x40U        // Digital Compare B Event 2 Int
                                               // Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the TZFLG register
//
//*****************************************************************************
#define EPWM_TZFLG_INT            0x1U         // Global Int Status Flag
#define EPWM_TZFLG_CBC            0x2U         // Trip Zones Cycle By Cycle
                                               // Flag
#define EPWM_TZFLG_OST            0x4U         // Trip Zones One Shot Flag
#define EPWM_TZFLG_DCAEVT1        0x8U         // Digital Compare A Event 1
                                               // Flag
#define EPWM_TZFLG_DCAEVT2        0x10U        // Digital Compare A Event 2
                                               // Flag
#define EPWM_TZFLG_DCBEVT1        0x20U        // Digital Compare B Event 1
                                               // Flag
#define EPWM_TZFLG_DCBEVT2        0x40U        // Digital Compare B Event 2
                                               // Flag

//*****************************************************************************
//
// The following are defines for the bit fields in the TZCBCFLG register
//
//*****************************************************************************
#define EPWM_TZCBCFLG_CBC1        0x1U         // Latched Status Flag for CBC1
                                               // Trip Latch
#define EPWM_TZCBCFLG_CBC2        0x2U         // Latched Status Flag for CBC2
                                               // Trip Latch
#define EPWM_TZCBCFLG_CBC3        0x4U         // Latched Status Flag for CBC3
                                               // Trip Latch
#define EPWM_TZCBCFLG_CBC4        0x8U         // Latched Status Flag for CBC4
                                               // Trip Latch
#define EPWM_TZCBCFLG_CBC5        0x10U        // Latched Status Flag for CBC5
                                               // Trip Latch
#define EPWM_TZCBCFLG_CBC6        0x20U        // Latched Status Flag for CBC6
                                               // Trip Latch
#define EPWM_TZCBCFLG_DCAEVT2     0x40U        // Latched Status Flag for
                                               // Digital Compare Output A Event 2
#define EPWM_TZCBCFLG_DCBEVT2     0x80U        // Latched Status Flag for
                                               // Digital Compare Output B Event 2

//*****************************************************************************
//
// The following are defines for the bit fields in the TZOSTFLG register
//
//*****************************************************************************
#define EPWM_TZOSTFLG_OST1        0x1U         // Latched Status Flag for OST1
                                               // Trip Latch
#define EPWM_TZOSTFLG_OST2        0x2U         // Latched Status Flag for OST2
                                               // Trip Latch
#define EPWM_TZOSTFLG_OST3        0x4U         // Latched Status Flag for OST3
                                               // Trip Latch
#define EPWM_TZOSTFLG_OST4        0x8U         // Latched Status Flag for OST4
                                               // Trip Latch
#define EPWM_TZOSTFLG_OST5        0x10U        // Latched Status Flag for OST5
                                               // Trip Latch
#define EPWM_TZOSTFLG_OST6        0x20U        // Latched Status Flag for OST6
                                               // Trip Latch
#define EPWM_TZOSTFLG_DCAEVT1     0x40U        // Latched Status Flag for
                                               // Digital Compare Output A Event 1
#define EPWM_TZOSTFLG_DCBEVT1     0x80U        // Latched Status Flag for
                                               // Digital Compare Output B Event 1

//*****************************************************************************
//
// The following are defines for the bit fields in the TZCLR register
//
//*****************************************************************************
#define EPWM_TZCLR_INT            0x1U         // Global Interrupt Clear Flag
#define EPWM_TZCLR_CBC            0x2U         // Cycle-By-Cycle Flag Clear
#define EPWM_TZCLR_OST            0x4U         // One-Shot Flag Clear
#define EPWM_TZCLR_DCAEVT1        0x8U         // DCAVET1 Flag Clear
#define EPWM_TZCLR_DCAEVT2        0x10U        // DCAEVT2 Flag Clear
#define EPWM_TZCLR_DCBEVT1        0x20U        // DCBEVT1 Flag Clear
#define EPWM_TZCLR_DCBEVT2        0x40U        // DCBEVT2 Flag Clear
#define EPWM_TZCLR_CBCPULSE_S     14U
#define EPWM_TZCLR_CBCPULSE_M     0xC000U      // Clear Pulse for CBC Trip
                                               // Latch

//*****************************************************************************
//
// The following are defines for the bit fields in the TZCBCCLR register
//
//*****************************************************************************
#define EPWM_TZCBCCLR_CBC1        0x1U         // Clear Flag for Cycle-By-Cycle
                                               // (CBC1) Trip Latch
#define EPWM_TZCBCCLR_CBC2        0x2U         // Clear Flag for Cycle-By-Cycle
                                               // (CBC2) Trip Latch
#define EPWM_TZCBCCLR_CBC3        0x4U         // Clear Flag for Cycle-By-Cycle
                                               // (CBC3) Trip Latch
#define EPWM_TZCBCCLR_CBC4        0x8U         // Clear Flag for Cycle-By-Cycle
                                               // (CBC4) Trip Latch
#define EPWM_TZCBCCLR_CBC5        0x10U        // Clear Flag for Cycle-By-Cycle
                                               // (CBC5) Trip Latch
#define EPWM_TZCBCCLR_CBC6        0x20U        // Clear Flag for Cycle-By-Cycle
                                               // (CBC6) Trip Latch
#define EPWM_TZCBCCLR_DCAEVT2     0x40U        // Clear Flag forDCAEVT2
                                               // selected for CBC
#define EPWM_TZCBCCLR_DCBEVT2     0x80U        // Clear Flag for DCBEVT2
                                               // selected for CBC

